zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K311_K310_100HDQFP-pinctrl.h
/* LCU0 */
#define PTA0_LCU0_OUT4                  NXP_SIUL2_PINMUX(0, 0, 0, 3, 0, 0)
#define PTA1_LCU0_OUT5                  NXP_SIUL2_PINMUX(0, 0, 1, 5, 0, 0)
#define PTA2_LCU0_OUT3                  NXP_SIUL2_PINMUX(0, 0, 2, 6, 0, 0)
#define PTA3_LCU0_OUT2                  NXP_SIUL2_PINMUX(0, 0, 3, 4, 0, 0)
#define PTB8_LCU0_OUT11                 NXP_SIUL2_PINMUX(0, 0, 40, 5, 0, 0)
#define PTB9_LCU0_OUT10                 NXP_SIUL2_PINMUX(0, 0, 41, 6, 0, 0)
#define PTB10_LCU0_OUT9                 NXP_SIUL2_PINMUX(0, 0, 42, 6, 0, 0)
#define PTB11_LCU0_OUT8                 NXP_SIUL2_PINMUX(0, 0, 43, 5, 0, 0)
#define PTB12_LCU0_OUT2                 NXP_SIUL2_PINMUX(0, 0, 44, 6, 0, 0)
#define PTB13_LCU0_OUT3                 NXP_SIUL2_PINMUX(0, 0, 45, 5, 0, 0)
#define PTB14_LCU0_OUT7                 NXP_SIUL2_PINMUX(0, 0, 46, 4, 0, 0)
#define PTC6_LCU0_OUT7                  NXP_SIUL2_PINMUX(0, 0, 70, 4, 0, 0)
#define PTC7_LCU0_OUT6                  NXP_SIUL2_PINMUX(0, 0, 71, 4, 0, 0)
#define PTC10_LCU0_OUT1                 NXP_SIUL2_PINMUX(0, 0, 74, 8, 0, 0)
#define PTC11_LCU0_OUT0                 NXP_SIUL2_PINMUX(0, 0, 75, 8, 0, 0)
#define PTD2_LCU0_OUT1                  NXP_SIUL2_PINMUX(0, 0, 98, 1, 0, 0)
#define PTD3_LCU0_OUT0                  NXP_SIUL2_PINMUX(0, 0, 99, 6, 0, 0)
#define PTD4_LCU0_OUT6                  NXP_SIUL2_PINMUX(0, 0, 100, 5, 0, 0)

/* FXIO */
#define PTA0_FXIO_D2_O                  NXP_SIUL2_PINMUX(0, 0, 0, 4, 0, 0)
#define PTA0_FXIO_D2_I                  NXP_SIUL2_PINMUX(0, 0, 0, 0, 154, 2)
#define PTA1_FXIO_D3_O                  NXP_SIUL2_PINMUX(0, 0, 1, 4, 0, 0)
#define PTA1_FXIO_D3_I                  NXP_SIUL2_PINMUX(0, 0, 1, 0, 155, 1)
#define PTA2_FXIO_D4_O                  NXP_SIUL2_PINMUX(0, 0, 2, 5, 0, 0)
#define PTA2_FXIO_D4_I                  NXP_SIUL2_PINMUX(0, 0, 2, 0, 156, 3)
#define PTA3_FXIO_D5_O                  NXP_SIUL2_PINMUX(0, 0, 3, 5, 0, 0)
#define PTA3_FXIO_D5_I                  NXP_SIUL2_PINMUX(0, 0, 3, 0, 157, 3)
#define PTA4_FXIO_D6_O                  NXP_SIUL2_PINMUX(0, 0, 4, 3, 0, 0)
#define PTA4_FXIO_D6_I                  NXP_SIUL2_PINMUX(0, 0, 4, 0, 158, 8)
#define PTA7_FXIO_D9_O                  NXP_SIUL2_PINMUX(0, 0, 7, 6, 0, 0)
#define PTA7_FXIO_D9_I                  NXP_SIUL2_PINMUX(0, 0, 7, 0, 161, 3)
#define PTA8_FXIO_D6_O                  NXP_SIUL2_PINMUX(0, 0, 8, 4, 0, 0)
#define PTA8_FXIO_D6_I                  NXP_SIUL2_PINMUX(0, 0, 8, 0, 158, 2)
#define PTA9_FXIO_D7_O                  NXP_SIUL2_PINMUX(0, 0, 9, 4, 0, 0)
#define PTA9_FXIO_D7_I                  NXP_SIUL2_PINMUX(0, 0, 9, 0, 159, 2)
#define PTA10_FXIO_D0_O                 NXP_SIUL2_PINMUX(0, 0, 10, 4, 0, 0)
#define PTA10_FXIO_D0_I                 NXP_SIUL2_PINMUX(0, 0, 10, 0, 152, 2)
#define PTA11_FXIO_D1_O                 NXP_SIUL2_PINMUX(0, 0, 11, 4, 0, 0)
#define PTA11_FXIO_D1_I                 NXP_SIUL2_PINMUX(0, 0, 11, 0, 153, 2)
#define PTA12_FXIO_D9_O                 NXP_SIUL2_PINMUX(0, 0, 12, 5, 0, 0)
#define PTA12_FXIO_D9_I                 NXP_SIUL2_PINMUX(0, 0, 12, 0, 161, 4)
#define PTA13_FXIO_D8_O                 NXP_SIUL2_PINMUX(0, 0, 13, 5, 0, 0)
#define PTA13_FXIO_D8_I                 NXP_SIUL2_PINMUX(0, 0, 13, 0, 160, 4)
#define PTA14_FXIO_D14_O                NXP_SIUL2_PINMUX(0, 0, 14, 6, 0, 0)
#define PTA14_FXIO_D14_I                NXP_SIUL2_PINMUX(0, 0, 14, 0, 166, 4)
#define PTB0_FXIO_D14_O                 NXP_SIUL2_PINMUX(0, 0, 32, 2, 0, 0)
#define PTB0_FXIO_D14_I                 NXP_SIUL2_PINMUX(0, 0, 32, 0, 166, 3)
#define PTB13_FXIO_D8_O                 NXP_SIUL2_PINMUX(0, 0, 45, 3, 0, 0)
#define PTB13_FXIO_D8_I                 NXP_SIUL2_PINMUX(0, 0, 45, 0, 160, 3)
#define PTC1_FXIO_D5_O                  NXP_SIUL2_PINMUX(0, 0, 65, 4, 0, 0)
#define PTC1_FXIO_D5_I                  NXP_SIUL2_PINMUX(0, 0, 65, 0, 157, 7)
#define PTC4_FXIO_D5_O                  NXP_SIUL2_PINMUX(0, 0, 68, 4, 0, 0)
#define PTC4_FXIO_D5_I                  NXP_SIUL2_PINMUX(0, 0, 68, 0, 157, 8)
#define PTC5_FXIO_D4_O                  NXP_SIUL2_PINMUX(0, 0, 69, 4, 0, 0)
#define PTC5_FXIO_D4_I                  NXP_SIUL2_PINMUX(0, 0, 69, 0, 156, 7)
#define PTC6_FXIO_D11_O                 NXP_SIUL2_PINMUX(0, 0, 70, 2, 0, 0)
#define PTC6_FXIO_D11_I                 NXP_SIUL2_PINMUX(0, 0, 70, 0, 163, 3)
#define PTC7_FXIO_D10_O                 NXP_SIUL2_PINMUX(0, 0, 71, 1, 0, 0)
#define PTC7_FXIO_D10_I                 NXP_SIUL2_PINMUX(0, 0, 71, 0, 162, 3)
#define PTC8_FXIO_D12_O                 NXP_SIUL2_PINMUX(0, 0, 72, 7, 0, 0)
#define PTC8_FXIO_D12_I                 NXP_SIUL2_PINMUX(0, 0, 72, 0, 164, 3)
#define PTC9_FXIO_D13_O                 NXP_SIUL2_PINMUX(0, 0, 73, 7, 0, 0)
#define PTC9_FXIO_D13_I                 NXP_SIUL2_PINMUX(0, 0, 73, 0, 165, 3)
#define PTC11_FXIO_D15_O                NXP_SIUL2_PINMUX(0, 0, 75, 4, 0, 0)
#define PTC11_FXIO_D15_I                NXP_SIUL2_PINMUX(0, 0, 75, 0, 167, 3)
#define PTC16_FXIO_D15_O                NXP_SIUL2_PINMUX(0, 0, 80, 6, 0, 0)
#define PTC16_FXIO_D15_I                NXP_SIUL2_PINMUX(0, 0, 80, 0, 167, 1)
#define PTC17_FXIO_D14_O                NXP_SIUL2_PINMUX(0, 0, 81, 6, 0, 0)
#define PTC17_FXIO_D2_O                 NXP_SIUL2_PINMUX(0, 0, 81, 7, 0, 0)
#define PTC17_FXIO_D2_I                 NXP_SIUL2_PINMUX(0, 0, 81, 0, 154, 10)
#define PTC17_FXIO_D14_I                NXP_SIUL2_PINMUX(0, 0, 81, 0, 166, 1)
#define PTD0_FXIO_D0_O                  NXP_SIUL2_PINMUX(0, 0, 96, 6, 0, 0)
#define PTD0_FXIO_D0_I                  NXP_SIUL2_PINMUX(0, 0, 96, 0, 152, 1)
#define PTD1_FXIO_D1_O                  NXP_SIUL2_PINMUX(0, 0, 97, 6, 0, 0)
#define PTD1_FXIO_D1_I                  NXP_SIUL2_PINMUX(0, 0, 97, 0, 153, 1)
#define PTD2_FXIO_D4_O                  NXP_SIUL2_PINMUX(0, 0, 98, 4, 0, 0)
#define PTD2_FXIO_D6_O                  NXP_SIUL2_PINMUX(0, 0, 98, 5, 0, 0)
#define PTD2_FXIO_D4_I                  NXP_SIUL2_PINMUX(0, 0, 98, 0, 156, 1)
#define PTD2_FXIO_D6_I                  NXP_SIUL2_PINMUX(0, 0, 98, 0, 158, 3)
#define PTD3_FXIO_D5_O                  NXP_SIUL2_PINMUX(0, 0, 99, 4, 0, 0)
#define PTD3_FXIO_D7_O                  NXP_SIUL2_PINMUX(0, 0, 99, 5, 0, 0)
#define PTD3_FXIO_D5_I                  NXP_SIUL2_PINMUX(0, 0, 99, 0, 157, 2)
#define PTD3_FXIO_D7_I                  NXP_SIUL2_PINMUX(0, 0, 99, 0, 159, 3)
#define PTD5_FXIO_D15_O                 NXP_SIUL2_PINMUX(0, 0, 101, 6, 0, 0)
#define PTD5_FXIO_D15_I                 NXP_SIUL2_PINMUX(0, 0, 101, 0, 167, 4)
#define PTD6_FXIO_D3_O                  NXP_SIUL2_PINMUX(0, 0, 102, 2, 0, 0)
#define PTD6_FXIO_D13_O                 NXP_SIUL2_PINMUX(0, 0, 102, 6, 0, 0)
#define PTD6_FXIO_D3_I                  NXP_SIUL2_PINMUX(0, 0, 102, 0, 155, 9)
#define PTD6_FXIO_D13_I                 NXP_SIUL2_PINMUX(0, 0, 102, 0, 165, 1)
#define PTD8_FXIO_D1_O                  NXP_SIUL2_PINMUX(0, 0, 104, 5, 0, 0)
#define PTD8_FXIO_D11_O                 NXP_SIUL2_PINMUX(0, 0, 104, 7, 0, 0)
#define PTD8_FXIO_D1_I                  NXP_SIUL2_PINMUX(0, 0, 104, 0, 153, 5)
#define PTD8_FXIO_D11_I                 NXP_SIUL2_PINMUX(0, 0, 104, 0, 163, 5)
#define PTD9_FXIO_D0_O                  NXP_SIUL2_PINMUX(0, 0, 105, 3, 0, 0)
#define PTD9_FXIO_D10_O                 NXP_SIUL2_PINMUX(0, 0, 105, 7, 0, 0)
#define PTD9_FXIO_D0_I                  NXP_SIUL2_PINMUX(0, 0, 105, 0, 152, 5)
#define PTD9_FXIO_D10_I                 NXP_SIUL2_PINMUX(0, 0, 105, 0, 162, 4)
#define PTD13_FXIO_D7_O                 NXP_SIUL2_PINMUX(0, 0, 109, 3, 0, 0)
#define PTD13_FXIO_D7_I                 NXP_SIUL2_PINMUX(0, 0, 109, 0, 159, 7)
#define PTD15_FXIO_D6_O                 NXP_SIUL2_PINMUX(0, 0, 111, 1, 0, 0)
#define PTD15_FXIO_D10_O                NXP_SIUL2_PINMUX(0, 0, 111, 7, 0, 0)
#define PTD15_FXIO_D6_I                 NXP_SIUL2_PINMUX(0, 0, 111, 0, 158, 7)
#define PTD15_FXIO_D10_I                NXP_SIUL2_PINMUX(0, 0, 111, 0, 162, 1)
#define PTD17_FXIO_D9_O                 NXP_SIUL2_PINMUX(0, 0, 113, 6, 0, 0)
#define PTD17_FXIO_D9_I                 NXP_SIUL2_PINMUX(0, 0, 113, 0, 161, 1)
#define PTE0_FXIO_D3_O                  NXP_SIUL2_PINMUX(0, 0, 128, 3, 0, 0)
#define PTE0_FXIO_D3_I                  NXP_SIUL2_PINMUX(0, 0, 128, 0, 155, 7)
#define PTE1_FXIO_D2_O                  NXP_SIUL2_PINMUX(0, 0, 129, 3, 0, 0)
#define PTE1_FXIO_D2_I                  NXP_SIUL2_PINMUX(0, 0, 129, 0, 154, 8)
#define PTE2_FXIO_D13_O                 NXP_SIUL2_PINMUX(0, 0, 130, 6, 0, 0)
#define PTE2_FXIO_D13_I                 NXP_SIUL2_PINMUX(0, 0, 130, 0, 165, 4)
#define PTE3_FXIO_D6_O                  NXP_SIUL2_PINMUX(0, 0, 131, 4, 0, 0)
#define PTE3_FXIO_D6_I                  NXP_SIUL2_PINMUX(0, 0, 131, 0, 158, 6)
#define PTE6_FXIO_D12_O                 NXP_SIUL2_PINMUX(0, 0, 134, 6, 0, 0)
#define PTE6_FXIO_D12_I                 NXP_SIUL2_PINMUX(0, 0, 134, 0, 164, 4)
#define PTE7_FXIO_D11_O                 NXP_SIUL2_PINMUX(0, 0, 135, 7, 0, 0)
#define PTE7_FXIO_D11_I                 NXP_SIUL2_PINMUX(0, 0, 135, 0, 163, 4)
#define PTE8_FXIO_D12_O                 NXP_SIUL2_PINMUX(0, 0, 136, 4, 0, 0)
#define PTE8_FXIO_D8_O                  NXP_SIUL2_PINMUX(0, 0, 136, 7, 0, 0)
#define PTE8_FXIO_D8_I                  NXP_SIUL2_PINMUX(0, 0, 136, 0, 160, 5)
#define PTE8_FXIO_D12_I                 NXP_SIUL2_PINMUX(0, 0, 136, 0, 164, 1)
#define PTE9_FXIO_D11_O                 NXP_SIUL2_PINMUX(0, 0, 137, 7, 0, 0)
#define PTE9_FXIO_D11_I                 NXP_SIUL2_PINMUX(0, 0, 137, 0, 163, 1)
#define PTE10_FXIO_D4_O                 NXP_SIUL2_PINMUX(0, 0, 138, 6, 0, 0)
#define PTE10_FXIO_D4_I                 NXP_SIUL2_PINMUX(0, 0, 138, 0, 156, 2)
#define PTE11_FXIO_D5_O                 NXP_SIUL2_PINMUX(0, 0, 139, 6, 0, 0)
#define PTE11_FXIO_D5_I                 NXP_SIUL2_PINMUX(0, 0, 139, 0, 157, 1)
#define PTE12_FXIO_D8_O                 NXP_SIUL2_PINMUX(0, 0, 140, 6, 0, 0)
#define PTE12_FXIO_D7_O                 NXP_SIUL2_PINMUX(0, 0, 140, 7, 0, 0)
#define PTE12_FXIO_D7_I                 NXP_SIUL2_PINMUX(0, 0, 140, 0, 159, 9)
#define PTE12_FXIO_D8_I                 NXP_SIUL2_PINMUX(0, 0, 140, 0, 160, 1)
#define PTE13_FXIO_D5_O                 NXP_SIUL2_PINMUX(0, 0, 141, 6, 0, 0)
#define PTE13_FXIO_D5_I                 NXP_SIUL2_PINMUX(0, 0, 141, 0, 157, 5)
#define PTE15_FXIO_D2_O                 NXP_SIUL2_PINMUX(0, 0, 143, 6, 0, 0)
#define PTE15_FXIO_D2_I                 NXP_SIUL2_PINMUX(0, 0, 143, 0, 154, 1)
#define PTE16_FXIO_D3_O                 NXP_SIUL2_PINMUX(0, 0, 144, 6, 0, 0)
#define PTE16_FXIO_D3_I                 NXP_SIUL2_PINMUX(0, 0, 144, 0, 155, 2)

