zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K311_K310_100HDQFP-pinctrl.h
/* LPUART0 */
#define PTA0_LPUART0_CTS                NXP_SIUL2_PINMUX(0, 0, 0, 0, 360, 1)
#define PTA1_LPUART0_RTS                NXP_SIUL2_PINMUX(0, 0, 1, 3, 0, 0)
#define PTA2_LPUART0_RX                 NXP_SIUL2_PINMUX(0, 0, 2, 0, 187, 1)
#define PTA3_LPUART0_TX_O               NXP_SIUL2_PINMUX(0, 0, 3, 6, 0, 0)
#define PTA3_LPUART0_TX_I               NXP_SIUL2_PINMUX(0, 0, 3, 0, 363, 1)
#define PTA6_LPUART0_RIN_B              NXP_SIUL2_PINMUX(0, 0, 6, 0, 375, 1)
#define PTA7_LPUART0_DCD_B              NXP_SIUL2_PINMUX(0, 0, 7, 0, 374, 1)
#define PTB0_LPUART0_RX                 NXP_SIUL2_PINMUX(0, 0, 32, 0, 187, 2)
#define PTB1_LPUART0_TX_O               NXP_SIUL2_PINMUX(0, 0, 33, 2, 0, 0)
#define PTB1_LPUART0_TX_I               NXP_SIUL2_PINMUX(0, 0, 33, 0, 363, 2)
#define PTB10_LPUART0_DTR_B             NXP_SIUL2_PINMUX(0, 0, 42, 3, 0, 0)
#define PTB11_LPUART0_DSR_B             NXP_SIUL2_PINMUX(0, 0, 43, 0, 373, 2)
#define PTB12_LPUART0_DCD_B             NXP_SIUL2_PINMUX(0, 0, 44, 0, 374, 2)
#define PTB13_LPUART0_RIN_B             NXP_SIUL2_PINMUX(0, 0, 45, 0, 375, 2)
#define PTC2_LPUART0_RX                 NXP_SIUL2_PINMUX(0, 0, 66, 0, 187, 3)
#define PTC3_LPUART0_TX_O               NXP_SIUL2_PINMUX(0, 0, 67, 4, 0, 0)
#define PTC3_LPUART0_TX_I               NXP_SIUL2_PINMUX(0, 0, 67, 0, 363, 3)
#define PTC8_LPUART0_CTS                NXP_SIUL2_PINMUX(0, 0, 72, 0, 360, 2)
#define PTC9_LPUART0_RTS                NXP_SIUL2_PINMUX(0, 0, 73, 3, 0, 0)
#define PTC10_LPUART0_DSR_B             NXP_SIUL2_PINMUX(0, 0, 74, 0, 373, 1)
#define PTC11_LPUART0_DTR_B             NXP_SIUL2_PINMUX(0, 0, 75, 2, 0, 0)

/* FCCU */
#define PTA2_FCCU_ERR0                  NXP_SIUL2_PINMUX(0, 0, 2, 1, 0, 0)
#define PTA2_FCCU_ERR_IN0               NXP_SIUL2_PINMUX(0, 0, 2, 0, 148, 1)
#define PTA3_FCCU_ERR1                  NXP_SIUL2_PINMUX(0, 0, 3, 1, 0, 0)
#define PTA3_FCCU_ERR_IN1               NXP_SIUL2_PINMUX(0, 0, 3, 0, 149, 1)
#define PTE15_FCCU_ERR0                 NXP_SIUL2_PINMUX(0, 0, 143, 1, 0, 0)
#define PTE15_FCCU_ERR_IN0              NXP_SIUL2_PINMUX(0, 0, 143, 0, 148, 2)
#define PTE16_FCCU_ERR1                 NXP_SIUL2_PINMUX(0, 0, 144, 1, 0, 0)
#define PTE16_FCCU_ERR_IN1              NXP_SIUL2_PINMUX(0, 0, 144, 0, 149, 2)

/* LPSPI1 */
#define PTA2_LPSPI1_SIN                 NXP_SIUL2_PINMUX(0, 0, 2, 0, 239, 2)
#define PTA3_LPSPI1_SCK_O               NXP_SIUL2_PINMUX(0, 0, 3, 3, 0, 0)
#define PTA3_LPSPI1_SCK_I               NXP_SIUL2_PINMUX(0, 0, 3, 0, 238, 1)
#define PTA6_LPSPI1_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 6, 3, 0, 0)
#define PTA6_LPSPI1_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 6, 0, 233, 1)
#define PTA11_LPSPI1_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 11, 6, 0, 0)
#define PTA11_LPSPI1_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 11, 0, 232, 2)
#define PTA12_LPSPI1_PCS5_O             NXP_SIUL2_PINMUX(0, 0, 12, 1, 0, 0)
#define PTA12_LPSPI1_PCS5_I             NXP_SIUL2_PINMUX(0, 0, 12, 0, 237, 1)
#define PTA13_LPSPI1_PCS4_O             NXP_SIUL2_PINMUX(0, 0, 13, 1, 0, 0)
#define PTA13_LPSPI1_PCS4_I             NXP_SIUL2_PINMUX(0, 0, 13, 0, 236, 1)
#define PTA14_LPSPI1_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 14, 3, 0, 0)
#define PTA14_LPSPI1_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 14, 0, 235, 2)
#define PTA16_LPSPI1_PCS2_O             NXP_SIUL2_PINMUX(0, 0, 16, 3, 0, 0)
#define PTA16_LPSPI1_PCS2_I             NXP_SIUL2_PINMUX(0, 0, 16, 0, 234, 2)
#define PTB14_LPSPI1_SCK_O              NXP_SIUL2_PINMUX(0, 0, 46, 3, 0, 0)
#define PTB14_LPSPI1_SCK_I              NXP_SIUL2_PINMUX(0, 0, 46, 0, 238, 2)
#define PTB15_LPSPI1_SIN_O              NXP_SIUL2_PINMUX(0, 0, 47, 3, 0, 0)
#define PTB15_LPSPI1_SIN_I              NXP_SIUL2_PINMUX(0, 0, 47, 0, 239, 1)
#define PTB16_LPSPI1_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 48, 3, 0, 0)
#define PTB16_LPSPI1_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 48, 0, 240, 2)
#define PTB17_LPSPI1_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 49, 3, 0, 0)
#define PTB17_LPSPI1_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 49, 0, 235, 1)
#define PTC6_LPSPI1_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 70, 3, 0, 0)
#define PTC6_LPSPI1_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 70, 0, 233, 4)
#define PTD2_LPSPI1_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 98, 3, 0, 0)
#define PTD2_LPSPI1_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 98, 0, 240, 1)
#define PTD3_LPSPI1_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 99, 3, 0, 0)
#define PTD3_LPSPI1_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 99, 0, 232, 1)
#define PTD4_LPSPI1_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 100, 3, 0, 0)
#define PTD4_LPSPI1_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 100, 0, 233, 6)

/* CMP0 */
#define PTA4_CMP0_OUT                   NXP_SIUL2_PINMUX(0, 0, 4, 4, 0, 0)
#define PTA11_CMP0_RR_ACTIVE            NXP_SIUL2_PINMUX(0, 0, 11, 5, 0, 0)
#define PTD14_CMP0_RR_ACTIVE            NXP_SIUL2_PINMUX(0, 0, 110, 6, 0, 0)
#define PTE3_CMP0_OUT                   NXP_SIUL2_PINMUX(0, 0, 131, 7, 0, 0)
#define PTE12_CMP0_RR_ACTIVE            NXP_SIUL2_PINMUX(0, 0, 140, 1, 0, 0)

/* JTAG */
#define PTA4_JTAG_TMSSWD_DIO_O          NXP_SIUL2_PINMUX(0, 0, 4, 7, 0, 0)
#define PTA4_JTAG_TMSSWD_DIO_I          NXP_SIUL2_PINMUX(0, 0, 4, 0, 186, 0)
#define PTC4_JTAG_TCKSWD_CLK            NXP_SIUL2_PINMUX(0, 0, 68, 0, 184, 0)
#define PTC5_JTAG_TDI                   NXP_SIUL2_PINMUX(0, 0, 69, 0, 185, 0)

/* LPI2C1 */
#define PTA4_LPI2C1_SDA_O               NXP_SIUL2_PINMUX(0, 0, 4, 8, 0, 0)
#define PTA4_LPI2C1_SDA_I               NXP_SIUL2_PINMUX(0, 0, 4, 0, 219, 6)
#define PTC4_LPI2C1_SCL_O               NXP_SIUL2_PINMUX(0, 0, 68, 8, 0, 0)
#define PTC4_LPI2C1_SCL_I               NXP_SIUL2_PINMUX(0, 0, 68, 0, 217, 7)
#define PTC5_LPI2C1_HREQ                NXP_SIUL2_PINMUX(0, 0, 69, 0, 216, 2)
#define PTC6_LPI2C1_SDA_O               NXP_SIUL2_PINMUX(0, 0, 70, 1, 0, 0)
#define PTC6_LPI2C1_SDA_I               NXP_SIUL2_PINMUX(0, 0, 70, 0, 219, 2)
#define PTC7_LPI2C1_SCL_O               NXP_SIUL2_PINMUX(0, 0, 71, 3, 0, 0)
#define PTC7_LPI2C1_SCL_I               NXP_SIUL2_PINMUX(0, 0, 71, 0, 217, 1)
#define PTC15_LPI2C1_SCL_O              NXP_SIUL2_PINMUX(0, 0, 79, 7, 0, 0)
#define PTC15_LPI2C1_SCL_I              NXP_SIUL2_PINMUX(0, 0, 79, 0, 217, 6)
#define PTC16_LPI2C1_SDAS_O             NXP_SIUL2_PINMUX(0, 0, 80, 4, 0, 0)
#define PTC16_LPI2C1_SDA_O              NXP_SIUL2_PINMUX(0, 0, 80, 7, 0, 0)
#define PTC16_LPI2C1_SDA_I              NXP_SIUL2_PINMUX(0, 0, 80, 0, 219, 5)
#define PTC16_LPI2C1_SDAS_I             NXP_SIUL2_PINMUX(0, 0, 80, 0, 220, 1)
#define PTC17_LPI2C1_SCLS_O             NXP_SIUL2_PINMUX(0, 0, 81, 4, 0, 0)
#define PTC17_LPI2C1_SCLS_I             NXP_SIUL2_PINMUX(0, 0, 81, 0, 218, 2)
#define PTD8_LPI2C1_SDA_O               NXP_SIUL2_PINMUX(0, 0, 104, 2, 0, 0)
#define PTD8_LPI2C1_SDA_I               NXP_SIUL2_PINMUX(0, 0, 104, 0, 219, 1)
#define PTD9_LPI2C1_SCL_O               NXP_SIUL2_PINMUX(0, 0, 105, 2, 0, 0)
#define PTD9_LPI2C1_SCL_I               NXP_SIUL2_PINMUX(0, 0, 105, 0, 217, 2)
#define PTD12_LPI2C1_HREQ               NXP_SIUL2_PINMUX(0, 0, 108, 0, 216, 1)

