zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K311_K310_100HDQFP-pinctrl.h
/* SYSTEM */
#define PTA12_CLKOUT_STANDBY            NXP_SIUL2_PINMUX(0, 0, 12, 3, 0, 0)
#define PTB4_CLKOUT_STANDBY             NXP_SIUL2_PINMUX(0, 0, 36, 8, 0, 0)
#define PTB5_CLKOUT_RUN                 NXP_SIUL2_PINMUX(0, 0, 37, 5, 0, 0)
#define PTD10_CLKOUT_RUN                NXP_SIUL2_PINMUX(0, 0, 106, 6, 0, 0)
#define PTD14_CLKOUT_RUN                NXP_SIUL2_PINMUX(0, 0, 110, 7, 0, 0)
#define PTE10_CLKOUT_STANDBY            NXP_SIUL2_PINMUX(0, 0, 138, 5, 0, 0)

/* LPSPI3 */
#define PTA6_LPSPI3_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 6, 6, 0, 0)
#define PTA6_LPSPI3_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 6, 0, 249, 5)
#define PTA9_LPSPI3_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 9, 6, 0, 0)
#define PTA9_LPSPI3_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 9, 0, 248, 3)
#define PTB12_LPSPI3_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 44, 1, 0, 0)
#define PTB12_LPSPI3_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 44, 0, 251, 1)
#define PTB13_LPSPI3_PCS2_O             NXP_SIUL2_PINMUX(0, 0, 45, 1, 0, 0)
#define PTB13_LPSPI3_PCS2_I             NXP_SIUL2_PINMUX(0, 0, 45, 0, 250, 1)
#define PTB17_LPSPI3_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 49, 6, 0, 0)
#define PTB17_LPSPI3_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 49, 0, 248, 2)
#define PTC2_LPSPI3_PCS2_O              NXP_SIUL2_PINMUX(0, 0, 66, 3, 0, 0)
#define PTC2_LPSPI3_PCS2_I              NXP_SIUL2_PINMUX(0, 0, 66, 0, 250, 4)
#define PTC16_LPSPI3_SIN_O              NXP_SIUL2_PINMUX(0, 0, 80, 1, 0, 0)
#define PTC16_LPSPI3_SIN_I              NXP_SIUL2_PINMUX(0, 0, 80, 0, 253, 3)
#define PTC17_LPSPI3_SCK_O              NXP_SIUL2_PINMUX(0, 0, 81, 1, 0, 0)
#define PTC17_LPSPI3_SCK_I              NXP_SIUL2_PINMUX(0, 0, 81, 0, 252, 3)
#define PTD0_LPSPI3_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 96, 3, 0, 0)
#define PTD0_LPSPI3_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 96, 0, 254, 1)
#define PTD1_LPSPI3_SCK_O               NXP_SIUL2_PINMUX(0, 0, 97, 3, 0, 0)
#define PTD1_LPSPI3_SCK_I               NXP_SIUL2_PINMUX(0, 0, 97, 0, 252, 1)
#define PTD7_LPSPI3_PCS3_O              NXP_SIUL2_PINMUX(0, 0, 103, 3, 0, 0)
#define PTD7_LPSPI3_PCS3_I              NXP_SIUL2_PINMUX(0, 0, 103, 0, 251, 5)
#define PTD8_LPSPI3_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 104, 1, 0, 0)
#define PTD8_LPSPI3_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 104, 0, 254, 3)
#define PTD17_LPSPI3_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 113, 5, 0, 0)
#define PTD17_LPSPI3_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 113, 0, 248, 1)
#define PTE7_LPSPI3_SCK_O               NXP_SIUL2_PINMUX(0, 0, 135, 6, 0, 0)
#define PTE7_LPSPI3_SCK_I               NXP_SIUL2_PINMUX(0, 0, 135, 0, 252, 2)
#define PTE8_LPSPI3_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 136, 1, 0, 0)
#define PTE8_LPSPI3_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 136, 0, 249, 1)
#define PTE10_LPSPI3_SIN_O              NXP_SIUL2_PINMUX(0, 0, 138, 2, 0, 0)
#define PTE10_LPSPI3_SIN_I              NXP_SIUL2_PINMUX(0, 0, 138, 0, 253, 1)

/* CAN0 */
#define PTA6_CAN0_RX                    NXP_SIUL2_PINMUX(0, 0, 6, 0, 0, 2)
#define PTA7_CAN0_TX                    NXP_SIUL2_PINMUX(0, 0, 7, 4, 0, 0)
#define PTB0_CAN0_RX                    NXP_SIUL2_PINMUX(0, 0, 32, 0, 0, 3)
#define PTB1_CAN0_TX                    NXP_SIUL2_PINMUX(0, 0, 33, 5, 0, 0)
#define PTC2_CAN0_RX                    NXP_SIUL2_PINMUX(0, 0, 66, 0, 0, 1)
#define PTC3_CAN0_TX                    NXP_SIUL2_PINMUX(0, 0, 67, 3, 0, 0)

/* LPUART3 */
#define PTA6_LPUART3_RX                 NXP_SIUL2_PINMUX(0, 0, 6, 0, 190, 2)
#define PTA7_LPUART3_TX_O               NXP_SIUL2_PINMUX(0, 0, 7, 1, 0, 0)
#define PTA7_LPUART3_TX_I               NXP_SIUL2_PINMUX(0, 0, 7, 0, 366, 1)
#define PTD2_LPUART3_TX_O               NXP_SIUL2_PINMUX(0, 0, 98, 6, 0, 0)
#define PTD2_LPUART3_TX_I               NXP_SIUL2_PINMUX(0, 0, 98, 0, 366, 2)
#define PTD3_LPUART3_RX                 NXP_SIUL2_PINMUX(0, 0, 99, 0, 190, 3)
#define PTE15_LPUART3_RX                NXP_SIUL2_PINMUX(0, 0, 143, 0, 190, 1)
#define PTE16_LPUART3_TX_O              NXP_SIUL2_PINMUX(0, 0, 144, 2, 0, 0)
#define PTE16_LPUART3_TX_I              NXP_SIUL2_PINMUX(0, 0, 144, 0, 366, 3)

/* LPUART1 */
#define PTA6_LPUART1_CTS                NXP_SIUL2_PINMUX(0, 0, 6, 0, 361, 2)
#define PTA7_LPUART1_RTS                NXP_SIUL2_PINMUX(0, 0, 7, 5, 0, 0)
#define PTA15_LPUART1_DTR_B             NXP_SIUL2_PINMUX(0, 0, 15, 5, 0, 0)
#define PTA16_LPUART1_DSR_B             NXP_SIUL2_PINMUX(0, 0, 16, 0, 378, 1)
#define PTB8_LPUART1_DCD_B              NXP_SIUL2_PINMUX(0, 0, 40, 0, 377, 1)
#define PTB9_LPUART1_RIN_B              NXP_SIUL2_PINMUX(0, 0, 41, 0, 376, 1)
#define PTC6_LPUART1_RX                 NXP_SIUL2_PINMUX(0, 0, 70, 0, 188, 1)
#define PTC7_LPUART1_TX_O               NXP_SIUL2_PINMUX(0, 0, 71, 2, 0, 0)
#define PTC7_LPUART1_TX_I               NXP_SIUL2_PINMUX(0, 0, 71, 0, 364, 1)
#define PTC8_LPUART1_RX                 NXP_SIUL2_PINMUX(0, 0, 72, 0, 188, 2)
#define PTC9_LPUART1_TX_O               NXP_SIUL2_PINMUX(0, 0, 73, 2, 0, 0)
#define PTC9_LPUART1_TX_I               NXP_SIUL2_PINMUX(0, 0, 73, 0, 364, 2)
#define PTD13_LPUART1_RX                NXP_SIUL2_PINMUX(0, 0, 109, 0, 188, 3)
#define PTD14_LPUART1_TX_O              NXP_SIUL2_PINMUX(0, 0, 110, 3, 0, 0)
#define PTD14_LPUART1_TX_I              NXP_SIUL2_PINMUX(0, 0, 110, 0, 364, 3)
#define PTE2_LPUART1_CTS                NXP_SIUL2_PINMUX(0, 0, 130, 0, 361, 1)
#define PTE6_LPUART1_RTS                NXP_SIUL2_PINMUX(0, 0, 134, 3, 0, 0)
#define PTE15_LPUART1_CTS               NXP_SIUL2_PINMUX(0, 0, 143, 0, 361, 3)
#define PTE16_LPUART1_RTS               NXP_SIUL2_PINMUX(0, 0, 144, 5, 0, 0)

/* LPSPI2 */
#define PTA8_LPSPI2_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 8, 3, 0, 0)
#define PTA8_LPSPI2_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 8, 0, 247, 1)
#define PTA9_LPSPI2_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 9, 3, 0, 0)
#define PTA9_LPSPI2_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 9, 0, 241, 1)
#define PTA15_LPSPI2_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 15, 4, 0, 0)
#define PTA15_LPSPI2_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 15, 0, 244, 1)
#define PTB2_LPSPI2_SIN_O               NXP_SIUL2_PINMUX(0, 0, 34, 3, 0, 0)
#define PTB2_LPSPI2_SIN_I               NXP_SIUL2_PINMUX(0, 0, 34, 0, 246, 2)
#define PTB3_LPSPI2_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 35, 3, 0, 0)
#define PTB3_LPSPI2_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 35, 0, 247, 2)
#define PTC10_LPSPI2_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 74, 4, 0, 0)
#define PTC10_LPSPI2_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 74, 0, 242, 3)
#define PTC12_LPSPI2_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 76, 4, 0, 0)
#define PTC12_LPSPI2_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 76, 0, 242, 4)
#define PTC14_LPSPI2_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 78, 3, 0, 0)
#define PTC14_LPSPI2_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 78, 0, 241, 2)
#define PTC15_LPSPI2_SCK_O              NXP_SIUL2_PINMUX(0, 0, 79, 3, 0, 0)
#define PTC15_LPSPI2_SCK_I              NXP_SIUL2_PINMUX(0, 0, 79, 0, 245, 2)
#define PTE10_LPSPI2_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 138, 3, 0, 0)
#define PTE10_LPSPI2_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 138, 0, 242, 1)
#define PTE11_LPSPI2_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 139, 2, 0, 0)
#define PTE11_LPSPI2_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 139, 0, 241, 3)
#define PTE13_LPSPI2_PCS2_O             NXP_SIUL2_PINMUX(0, 0, 141, 3, 0, 0)
#define PTE13_LPSPI2_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 141, 5, 0, 0)
#define PTE13_LPSPI2_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 141, 0, 241, 5)
#define PTE13_LPSPI2_PCS2_I             NXP_SIUL2_PINMUX(0, 0, 141, 0, 243, 2)
#define PTE15_LPSPI2_SCK_O              NXP_SIUL2_PINMUX(0, 0, 143, 3, 0, 0)
#define PTE15_LPSPI2_SCK_I              NXP_SIUL2_PINMUX(0, 0, 143, 0, 245, 1)
#define PTE16_LPSPI2_SIN_O              NXP_SIUL2_PINMUX(0, 0, 144, 3, 0, 0)
#define PTE16_LPSPI2_SIN_I              NXP_SIUL2_PINMUX(0, 0, 144, 0, 246, 1)

/* LPUART2 */
#define PTA8_LPUART2_RX                 NXP_SIUL2_PINMUX(0, 0, 8, 0, 189, 3)
#define PTA9_LPUART2_TX_O               NXP_SIUL2_PINMUX(0, 0, 9, 2, 0, 0)
#define PTA9_LPUART2_TX_I               NXP_SIUL2_PINMUX(0, 0, 9, 0, 365, 1)
#define PTC15_LPUART2_TX_O              NXP_SIUL2_PINMUX(0, 0, 79, 5, 0, 0)
#define PTC15_LPUART2_TX_I              NXP_SIUL2_PINMUX(0, 0, 79, 0, 365, 2)
#define PTC16_LPUART2_RX                NXP_SIUL2_PINMUX(0, 0, 80, 0, 189, 5)
#define PTD6_LPUART2_RX                 NXP_SIUL2_PINMUX(0, 0, 102, 0, 189, 1)
#define PTD7_LPUART2_TX_O               NXP_SIUL2_PINMUX(0, 0, 103, 2, 0, 0)
#define PTD7_LPUART2_TX_I               NXP_SIUL2_PINMUX(0, 0, 103, 0, 365, 3)
#define PTD11_LPUART2_CTS               NXP_SIUL2_PINMUX(0, 0, 107, 0, 362, 1)
#define PTD12_LPUART2_RTS               NXP_SIUL2_PINMUX(0, 0, 108, 3, 0, 0)
#define PTD15_LPUART2_CTS               NXP_SIUL2_PINMUX(0, 0, 111, 0, 362, 2)
#define PTD16_LPUART2_RTS               NXP_SIUL2_PINMUX(0, 0, 112, 6, 0, 0)
#define PTD17_LPUART2_RX                NXP_SIUL2_PINMUX(0, 0, 113, 0, 189, 2)
#define PTE3_LPUART2_RTS                NXP_SIUL2_PINMUX(0, 0, 131, 5, 0, 0)
#define PTE9_LPUART2_CTS                NXP_SIUL2_PINMUX(0, 0, 137, 0, 362, 3)
#define PTE12_LPUART2_TX_O              NXP_SIUL2_PINMUX(0, 0, 140, 3, 0, 0)
#define PTE12_LPUART2_TX_I              NXP_SIUL2_PINMUX(0, 0, 140, 0, 365, 4)

/* JTAGTRACENOETM */
#define PTA10_JTAG_TDOTRACENOETM_SWO    NXP_SIUL2_PINMUX(0, 0, 10, 7, 0, 0)

