zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K311_K310_100HDQFP-pinctrl.h
/* CAN1 */
#define PTA11_CAN1_TX                   NXP_SIUL2_PINMUX(0, 0, 11, 1, 0, 0)
#define PTA12_CAN1_RX                   NXP_SIUL2_PINMUX(0, 0, 12, 0, 1, 2)
#define PTC2_CAN1_RX                    NXP_SIUL2_PINMUX(0, 0, 66, 0, 1, 6)
#define PTC3_CAN1_TX                    NXP_SIUL2_PINMUX(0, 0, 67, 8, 0, 0)
#define PTC8_CAN1_TX                    NXP_SIUL2_PINMUX(0, 0, 72, 3, 0, 0)
#define PTC9_CAN1_RX                    NXP_SIUL2_PINMUX(0, 0, 73, 0, 1, 1)

/* LPI2C0 */
#define PTB0_LPI2C0_SDAS_O              NXP_SIUL2_PINMUX(0, 0, 32, 1, 0, 0)
#define PTB0_LPI2C0_SDAS_I              NXP_SIUL2_PINMUX(0, 0, 32, 0, 215, 1)
#define PTB1_LPI2C0_SCLS_O              NXP_SIUL2_PINMUX(0, 0, 33, 1, 0, 0)
#define PTB1_LPI2C0_SCLS_I              NXP_SIUL2_PINMUX(0, 0, 33, 0, 213, 1)
#define PTB11_LPI2C0_HREQ               NXP_SIUL2_PINMUX(0, 0, 43, 0, 211, 1)
#define PTC7_LPI2C0_HREQ                NXP_SIUL2_PINMUX(0, 0, 71, 0, 211, 2)
#define PTC8_LPI2C0_SCL_O               NXP_SIUL2_PINMUX(0, 0, 72, 1, 0, 0)
#define PTC8_LPI2C0_SCL_I               NXP_SIUL2_PINMUX(0, 0, 72, 0, 212, 1)
#define PTC9_LPI2C0_SDA_O               NXP_SIUL2_PINMUX(0, 0, 73, 1, 0, 0)
#define PTC9_LPI2C0_SDA_I               NXP_SIUL2_PINMUX(0, 0, 73, 0, 214, 1)
#define PTD13_LPI2C0_SDA_O              NXP_SIUL2_PINMUX(0, 0, 109, 4, 0, 0)
#define PTD13_LPI2C0_SDA_I              NXP_SIUL2_PINMUX(0, 0, 109, 0, 214, 2)
#define PTD14_LPI2C0_SCL_O              NXP_SIUL2_PINMUX(0, 0, 110, 4, 0, 0)
#define PTD14_LPI2C0_SCL_I              NXP_SIUL2_PINMUX(0, 0, 110, 0, 212, 2)

/* LCU1 */
#define PTB0_LCU1_OUT5                  NXP_SIUL2_PINMUX(0, 0, 32, 5, 0, 0)
#define PTB1_LCU1_OUT4                  NXP_SIUL2_PINMUX(0, 0, 33, 7, 0, 0)
#define PTB2_LCU1_OUT3                  NXP_SIUL2_PINMUX(0, 0, 34, 5, 0, 0)
#define PTB3_LCU1_OUT2                  NXP_SIUL2_PINMUX(0, 0, 35, 6, 0, 0)
#define PTC8_LCU1_OUT7                  NXP_SIUL2_PINMUX(0, 0, 72, 5, 0, 0)
#define PTC9_LCU1_OUT6                  NXP_SIUL2_PINMUX(0, 0, 73, 5, 0, 0)
#define PTC10_LCU1_OUT11                NXP_SIUL2_PINMUX(0, 0, 74, 6, 0, 0)
#define PTC11_LCU1_OUT10                NXP_SIUL2_PINMUX(0, 0, 75, 7, 0, 0)
#define PTC12_LCU1_OUT9                 NXP_SIUL2_PINMUX(0, 0, 76, 6, 0, 0)
#define PTC13_LCU1_OUT8                 NXP_SIUL2_PINMUX(0, 0, 77, 6, 0, 0)
#define PTC14_LCU1_OUT1                 NXP_SIUL2_PINMUX(0, 0, 78, 6, 0, 0)
#define PTC15_LCU1_OUT0                 NXP_SIUL2_PINMUX(0, 0, 79, 6, 0, 0)

/* HSE */
#define PTB0_HSE_TAMPER_LOOP_OUT0       NXP_SIUL2_PINMUX(0, 0, 32, 7, 0, 0)
#define PTB1_HSE_TAMPER_EXTIN0          NXP_SIUL2_PINMUX(0, 0, 33, 0, 343, 1)

/* ADC1 */
#define PTB2_ADC1_MA0                   NXP_SIUL2_PINMUX(0, 0, 34, 1, 0, 0)
#define PTC12_ADC1_MA2                  NXP_SIUL2_PINMUX(0, 0, 76, 1, 0, 0)
#define PTC13_ADC1_MA1                  NXP_SIUL2_PINMUX(0, 0, 77, 4, 0, 0)

/* ADC0 */
#define PTB3_ADC0_MA0                   NXP_SIUL2_PINMUX(0, 0, 35, 4, 0, 0)
#define PTC6_ADC0_MA2                   NXP_SIUL2_PINMUX(0, 0, 70, 7, 0, 0)
#define PTC14_ADC0_MA1                  NXP_SIUL2_PINMUX(0, 0, 78, 4, 0, 0)
#define PTC15_ADC0_MA2                  NXP_SIUL2_PINMUX(0, 0, 79, 4, 0, 0)
#define PTE2_ADC0_MA0                   NXP_SIUL2_PINMUX(0, 0, 130, 7, 0, 0)
#define PTE6_ADC0_MA1                   NXP_SIUL2_PINMUX(0, 0, 134, 7, 0, 0)

/* CAN2 */
#define PTC6_CAN2_RX                    NXP_SIUL2_PINMUX(0, 0, 70, 0, 2, 6)
#define PTC7_CAN2_TX                    NXP_SIUL2_PINMUX(0, 0, 71, 7, 0, 0)
#define PTC14_CAN2_RX                   NXP_SIUL2_PINMUX(0, 0, 78, 0, 2, 2)
#define PTC15_CAN2_TX                   NXP_SIUL2_PINMUX(0, 0, 79, 1, 0, 0)
#define PTC16_CAN2_RX                   NXP_SIUL2_PINMUX(0, 0, 80, 0, 2, 1)
#define PTC17_CAN2_TX                   NXP_SIUL2_PINMUX(0, 0, 81, 3, 0, 0)

#endif /* HAL_NXP_DTS_NXP_S32_S32K311_K310_100HDQFP_PINCTRL_H_ */
